XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Toshiba.TXZ4Aplus-M4M1_DFP.pdsc
          <feature type="ADC"           n="8"      m="12"               name="Analog to Digital Converter A (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter B (ADC)"/>
          <feature type="ADC"           n="3"      m="12"               name="Analog to Digital Converter C (ADC)"/>

          <feature type="CoreOther"     n="1"                           name="Advanced Vector Engine Plus (A-VE+)xxxxxxxxxxxxxxxxxxx"/>
          <feature type="CoreOther"     n="3"                           name="Programmable Motor Driver Plus (PMD+)"/>
          <feature type="CoreOther"     n="1"                           name="Advanced Encoder input Circuit (A-ENC)"/>

          <feature type="PowerOther"    n="1"                           name="Low-Voltage Detector (LVD)"/>
          <feature type="WDT"           n="1"                           name="Selectable clock Watch dog timer (SIWDT)"/>
          <feature type="Other"         n="1"                           name="Oscillation Frequency Detector (OFD)"/>
          <feature type="PowerOther"    n="1"                           name="Power-on Reset Circuit (POR)"/>

          <feature type="VCC"           n="2.70"   m="5.50"/>
          <feature type="Temp"          n="-40"    m="105"/>
          <feature type="QFP"           n="64"                         name="P-LQFP64-1414-0.8-002"/>
          <!--book name=""/-->

        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="TMPM4MYA Compiler">
      <accept condition="Compiler ARMCC"/>
      <accept condition="Compiler IAR"/>
    </condition>

    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="TMPM4MNx CMSIS">
      <description>Toshiba TMPM4MNx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4MN*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4MMx CMSIS">
      <description>Toshiba TMPM4MMx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4MM*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="TMPM4MLx CMSIS">
      <description>Toshiba TMPM4MLx Devices and CMSIS-CORE</description>
      <require Dvendor="Toshiba:92" Dname="TMPM4ML*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>

    <!-- Startup TMPM4MNx -->
    <!-- Startup TMPM4MNx N=100P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4MNx CMSIS">
      <description>System Startup for Toshiba TMPM4MNx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4MYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4MNA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4MNA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4MxA.c"      attr="config" version="1.0.0" condition="TMPM4MYA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4MMx -->
    <!-- Startup TMPM4MMx M=80P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4MMx CMSIS">
      <description>System Startup for Toshiba TMPM4MMx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4MYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4MMA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4MMA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4MxA.c"      attr="config" version="1.0.0" condition="TMPM4MYA Compiler"/>
      </files>
    </component>

    <!-- Startup TMPM4MLx -->
    <!-- Startup TMPM4MLx L=64P -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TMPM4MLx CMSIS">
      <description>System Startup for Toshiba TMPM4MLx Devices</description>
      <files>
        <file category="include" name="Device/Include/" condition="TMPM4MYA Compiler"/>
        <file category="source"  name="Device/Source/ARM/startup_TMPM4MLA.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/IAR/startup_TMPM4MLA.s" attr="config" version="1.0.0" condition="Compiler IAR"/>
        <file category="source"  name="Device/Source/system_TMPM4MxA.c"      attr="config" version="1.0.0" condition="TMPM4MYA Compiler"/>
      </files>
    </component>
  </components>

</package>
